In [61]:
import numpy as np
import pandas as pd

In [62]:
area = pd.Series({'California':423967, 'Texas': 695662, 'NY': 141297, 'Florida': 170312, 'Illinois': 149995})
pop = pd.Series({'California':38332521, 'Texas': 26448193, 'NY': 19651127, 'Florida': 19552860, 'Illinois': 12882135})
df= pd.DataFrame({'area':area, 'population':pop})
df

              area  population
California  423967    38332521
Texas       695662    26448193
NY          141297    19651127
Florida     170312    19552860
Illinois    149995    12882135

In [63]:
df['density'] = df['population']  / df['area']
df

              area  population     density
California  423967    38332521   90.413926
Texas       695662    26448193   38.018740
NY          141297    19651127  139.076746
Florida     170312    19552860  114.806121
Illinois    149995    12882135   85.883763

In [64]:
df.loc['Texas':,:'population']

            area  population
Texas     695662    26448193
NY        141297    19651127
Florida   170312    19552860
Illinois  149995    12882135

In [65]:
df.iloc[1:,].loc[:,:'population']

            area  population
Texas     695662    26448193
NY        141297    19651127
Florida   170312    19552860
Illinois  149995    12882135

In [66]:
df.loc[df.loc[:,'population'] > 25000000]
# loc gaat voort op indexen. Als je iloc wil gebruiken moet je via list comprehension (.values) omvormen naar waarden
# (zie verder)

              area  population    density
California  423967    38332521  90.413926
Texas       695662    26448193  38.018740

In [67]:
df_T = df.T
df_T.loc['population',:] >= 25000000

California     True
Texas          True
NY            False
Florida       False
Illinois      False
Name: population, dtype: bool

In [68]:
df_T.loc[:, df_T.loc['population',:] >= 25000000]
# Transpose wijzigt data type omdat data type per kolom vastligt.

              California         Texas
area        4.239670e+05  6.956620e+05
population  3.833252e+07  2.644819e+07
density     9.041393e+01  3.801874e+01

In [69]:
df.loc[df.loc[:,'density'] >= 100]

           area  population     density
NY       141297    19651127  139.076746
Florida  170312    19552860  114.806121

In [70]:
func = lambda datafr : datafr.density >= 100

df.loc[func,:]

           area  population     density
NY       141297    19651127  139.076746
Florida  170312    19552860  114.806121

In [71]:
df.iloc[(df.loc[:,'density'] >= 100).values]
# voorbeeld iloc i.c.m. list comprehension -> waarden

           area  population     density
NY       141297    19651127  139.076746
Florida  170312    19552860  114.806121

In [72]:
# zie vb. list comprehension in voorbeeld Tim

In [73]:
f = lambda x : x**2
# is hetzelfde als
def f(x):
    return x**2
# lambda is een verkorte manier om functies te definiëren

In [77]:
df2 = df.iloc[1:,:].copy()
# .copy() vermijdt SettingWithCopyWarning
df2.loc[:, 'population'] = df2.loc[:, 'population'] + np.random.randint(1, 10**4, size=df2[ 'population'].shape)
df2

            area  population     density
Texas     695662    26471629   38.018740
NY        141297    19664892  139.076746
Florida   170312    19565786  114.806121
Illinois  149995    12907431   85.883763

In [82]:
df1 = df.iloc[:-1].copy()
df1

              area  population     density
California  423967    38332521   90.413926
Texas       695662    26462579   38.018740
NY          141297    19656286  139.076746
Florida     170312    19560790  114.806121

In [84]:
df_diff = df1.population - df2.population
df_diff

California       NaN
Florida      -4996.0
Illinois         NaN
NY           -8606.0
Texas        -9050.0
Name: population, dtype: float64

In [91]:
df_diff = df1.population.subtract(df2.population, fill_value=0)
df_diff

California    38332521.0
Florida          -4996.0
Illinois     -12907431.0
NY               -8606.0
Texas            -9050.0
Name: population, dtype: float64